
[A_ChainLightning H7HeroAbility]
mName="Цепь молний"
mTooltip="Мгновенно наносит выбранному отряду от %d.min до %d.max ед. урона от %d.icon магии воздуха, а затем поражает дополнительно не более трех ближайших случайных отрядов, нанося вдвое меньше урона каждой последующей цели."
mTooltipMagicGuild="Мгновенно наносит выбранному вражескому отряду урон от %ICON_AIR магии воздуха, а затем поражает дополнительно не более трех ближайших случайных отрядов, нанося вдвое меньше урона каждой последующей цели."
mTooltipMagicGuildRankLine="от %d.min до %d.max ед. урона %ICON_AIR"
[A_GustOfWind H7HeroAbility]
mName="Шквал"
mTooltip="Мгновенно отбрасывает выбранный отряд на %special1.val1 кл. по прямой или на %special1.val2 кл. по диагонали."
mTooltipMagicGuild="Отбрасывает выбранный отряд в указанном направлении."
mTooltipUpgraded="Мгновенно отбрасывает выбранный отряд на %special2.val1 кл. по прямой или на %special2.val2 кл. по диагонали, и наносит от %d.min до %d.max ед. урона от %d.icon магии воздуха."
mTooltipMagicGuildRankLine="на %special2.val1 кл. по прямой или на %special2.val2 кл. по диагонали"
[A_StormArrows H7HeroAbility]
mName="Грозовые стрелы"
mTooltip="Усиливает %buff1.buff.stat2.icon атаку дальнего боя дружественного отряда на %buff1.buff.stat2.norm. Длительность (ходов): %buff2.buff.durini."
mTooltipMagicGuild="Усиливает %buff1.buff.stat2.icon атаку дальнего боя дружественного отряда. Длительность (ходов): %buff2.buff.durini."
mTooltipUpgraded="Усиливает %buff1.buff.stat2.icon атаку дальнего боя всех дружественных отрядов в выбранной области 4x4 на %buff1.buff.stat2.norm, а также дает бонус: %buff2.buff.stat1.icon 100%. Длительность (ходов): %buff2.buff.durini."
mTooltipMagicGuildRankLine="%buff1.buff.stat2 к %ICON_ATTACK атаке"
[A_StormArrows_Buff H7BaseBuff]
mName="Грозовые стрелы"
mTooltip="%stat2 к %stat2.icon атаке.\nДлительность (ходов): %durnow."
[A_LightningBurst H7HeroAbility]
mName="Грозовой разряд"
mTooltip="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом существам от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона от %buff1.buff.d1.icon магии воздуха. Если вокруг нет ни одного существа, действие заклинания не прекращается."
mTooltipMagicGuild="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом существам урон от %buff1.buff.d1.icon магии воздуха. Если вокруг нет ни одного существа, действие заклинания не прекращается."
mTooltipUpgraded="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом вражеским существам от %buff3.buff.d1.min до %buff3.buff.d1.max ед. урона от магии %buff3.buff.d1.icon воздуха и меняет текущий показатель %ICON_INITIATIVE инициативы этих существ на %buff3.buff.buff3.buff.stat.norm. Если вокруг нет ни одного существа, действие заклинания не прекращается."
mTooltipMagicGuildRankLine="от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона %ICON_AIR"
[A_LightningBurst_Buff H7BaseBuff]
mName="Грозовой разряд"
mTooltip="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом существам от %d1.min до %d1.max ед. урона от %d1.icon магии воздуха. Если вокруг нет ни одного существа, действие заклинания не прекращается."
[A_Shocked_Buff H7BaseBuff]
mName="Удар молнии"
mTooltip="%stat.icon Инициатива отряда снижается до %stat.norm. Длительность (ходов): %durnow."
[A_YlathsClairvoyance H7HeroAbility]
mName="Взор Илата"
mTooltip="Открывает область на карте в радиусе %special."
mTooltipMagicGuild="Открывает область на карте."
mTooltipMagicGuildRankLine="радиус: %special"
[Imprinted.A_ChainLightning_Imprinted H7HeroAbility]
mName="Цепь молний"
mTooltip="Мгновенно наносит выбранному отряду от %d.min до %d.max ед. урона от %d.icon магии воздуха, а затем поражает дополнительно не более трех ближайших случайных отрядов, нанося вдвое меньше урона каждой последующей цели."
[Imprinted.A_Cyclone_Imprinted H7HeroAbility]
mName="Вихрь"
mTooltip="Вихрь наносит всем существам в выбранной области 2x2 от %d.min до %d.max ед. урона от %d.icon магии воздуха, поднимает их над землей и случайным образом разбрасывает в окружающей области 8x8."
[Imprinted.A_GustOfWind_Imprinted H7HeroAbility]
mName="Шквал"
mTooltip="Мгновенно отбрасывает выбранный отряд на %special1.val1 кл. по прямой или на %special1.val2 кл. по диагонали."
[Imprinted.A_LightningBolt_Imprinted H7HeroAbility]
mName="Молния"
mTooltip="Мгновенно наносит выбранному вражескому отряду от %d.min до %d.max ед. урона от %d.icon магии воздуха."
[Imprinted.A_LightningBurst_Imprinted H7HeroAbility]
mName="Грозовой разряд"
mTooltip="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом существам от %buff1.buff.d1.min до %buff1.buff.d1.max ед. урона от %buff1.buff.d1.icon магии воздуха. Если вокруг нет ни одного существа, действие заклинания не прекращается."
[Imprinted.A_LightningBurst_Imprinted_Buff H7BaseBuff]
mName="Грозовой разряд"
mTooltip="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом существам от %d1.min до %d1.max ед. урона от %d1.icon магии воздуха. Если вокруг нет ни одного существа, действие заклинания не прекращается."
[Imprinted.A_StormArrows_Imprinted H7HeroAbility]
mName="Грозовые стрелы"
mTooltip="Усиливает %buff1.buff.stat2.icon атаку дальнего боя дружественного отряда на %buff1.buff.stat2.norm. Длительность (ходов): %buff1.buff.durini."
[Imprinted.A_StormArrows_Imprinted_Buff H7BaseBuff]
mName="Грозовые стрелы"
mTooltip="%stat2 к %stat2.icon атаке.\nДлительность (ходов): %durnow."
[Imprinted.A_YlathsClairvoyance_Imprinted H7HeroAbility]
mName="Взор Илата"
mTooltip="Открывает область на карте в радиусе %special."
[A_StormArrows_Buff_Upgraded H7BaseBuff]
mName="Грозовые стрелы"
mTooltip="%stat2 к %stat2.icon атаке.\n%stat1.icon 100%\nДлительность (ходов): %durnow."
[A_LightningBurst_Buff_Upgraded H7BaseBuff]
mName="Грозовой разряд"
mTooltip="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом вражеским существам от %d1.min до %d1.max ед. урона от %d1.icon магии воздуха и меняет текущий показатель %ICON_INITIATIVE инициативы этих существ на %buff3.buff.stat.norm. Если вокруг нет ни одного существа, действие заклинания не прекращается."
[Imprinted.A_LightningBolt_Imprinted_Artifact H7HeroAbility]
mName="Молния"
mTooltip="Мгновенно наносит выбранному вражескому отряду от %d.min до %d.max ед. урона от %d.icon магии воздуха."
[A_LightningBurst_Buff_Positive H7BaseBuff]
mName="Грозовой разряд"
mTooltip="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом существам от %d1.min до %d1.max ед. урона от %d1.icon магии воздуха. Если вокруг нет ни одного существа, действие заклинания не прекращается."
[Imprinted.A_LightningBurst_Imprinted_Buff_Positive H7BaseBuff]
mName="Грозовой разряд"
mTooltip="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом существам от %d1.min до %d1.max ед. урона от %d1.icon магии воздуха. Если вокруг нет ни одного существа, действие заклинания не прекращается."
[A_LightningBurst_Buff_Positive_Upgraded H7BaseBuff]
mName="Грозовой разряд"
mTooltip="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом вражеским существам от %d1.min до %d1.max ед. урона от %d1.icon магии воздуха и меняет текущий показатель %ICON_INITIATIVE инициативы этих существ на %buff3.buff.stat.norm. Даже если вокруг нет ни одного существа, действие заклинания не прекращается."
[A_ErraticStorm_Buff_Cell H7BaseBuff]
mName="Буйство стихии"
[A_LightningBurst_Buff_Negative_Upgraded H7BaseBuff]
mName="Грозовой разряд"
mTooltip="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом вражеским существам от %d1.min до %d1.max ед. урона от %d1.icon магии воздуха и меняет текущий показатель %ICON_INITIATIVE инициативы этих существ на %buff3.buff.stat.norm. Даже если вокруг нет ни одного существа, действие заклинания не прекращается."
[A_ErraticStorm H7HeroAbility]
mName="Буйство стихии"
mTooltip="Создает в выбранной области 4x4 бурю, которая будет длиться в течение %durini раунда(ов). Все оказавшиеся в области действия заклинания существа, ведущие дальний бой, получают %buff1.buff.stat к %icon_attack атаке. Атаки дальнего боя, пересекающие область действия заклинания, наносят только 10% от полного урона."
mTooltipMagicGuild="Создает в выбранной области 4x4 бурю, которая будет длиться в течение нескольких раундов. У всех оказавшихся в области действия заклинания существ, ведущих дальний бой, снижается показатель %icon_attack атаки. Атаки дальнего боя, пересекающие область действия заклинания, наносят только 10% от полного урона."
mTooltipMagicGuildRankLine="«Буйство стихии» длится в течение %durini раунда(ов). %buff1.buff.stat к %icon_attack атаке."
[A_LightningBurst_Buff_Negative H7BaseBuff]
mName="Грозовой разряд"
mTooltip="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом существам от %d1.min до %d1.max ед. урона от %d1.icon магии воздуха. Если вокруг нет ни одного существа, действие заклинания не прекращается."
[Imprinted.A_LightningBurst_Imprinted_Buff_Negative H7BaseBuff]
mName="Грозовой разряд"
mTooltip="Выбранный отряд в начале каждого своего хода наносит всем находящимся рядом существам от %d1.min до %d1.max ед. урона от %d1.icon магии воздуха. Если вокруг нет ни одного существа, действие заклинания не прекращается."

UCP MOD

[Imprinted.A_ErraticStorm_Imprinted H7HeroAbility]
mName="Буйство стихии"
mTooltip="Создает в выбранной области 4x4 бурю, которая будет длиться в течение %durini раунда(ов). Все оказавшиеся в области действия заклинания существа, ведущие дальний бой, получают %buff1.buff.stat к %icon_attack атаке. Атаки дальнего боя, пересекающие область действия заклинания, наносят только 10% от полного урона."

[A_LightningBolt H7HeroAbility]
mName="Молния"
mTooltip="Мгновенно наносит выбранному вражескому отряду от %d.min до %d.max ед. урона от %d.icon магии воздуха."
mTooltipMagicGuild="Мгновенно наносит выбранному вражескому отряду урон от %d.icon магии воздуха."
mTooltipUpgraded="Мгновенно наносит выбранному вражескому отряду от %d.min до %d.max ед. урона от %d.icon магии воздуха и меняет его текущий показатель %buff1.buff.stat.icon инициативы на %buff1.buff.stat.norm до конца хода. Все находящиеся рядом вражеские существа получат от %buff1.buff.d.min до %buff2.buff.d.max ед. урона от %buff2.buff.d.icon магии воздуха."
mTooltipMagicGuildRankLine="от %d.min до %d.max ед. урона %ICON_AIR"

UCP 1.1

[A_ErraticStorm_Buff_Creature H7BaseBuff]
mName="Буйство стихии"
mTooltip="Отряд получает только 10% урона от атак дальнего боя. Существа, атакующие в дальнем бою, получают %stat к %icon_attack атаке.\nДлится до тех пор, пока существо находится в зоне действия заклинания."

[Imprinted.A_ErraticStorm_Imprinted_Buff_Creature H7BaseBuff]
mName="Буйство стихии"
mTooltip="Отряд получает только 10% урона от атак дальнего боя. Существа, атакующие в дальнем бою, получают %stat к %icon_attack атаке.\nДлится до тех пор, пока существо находится в зоне действия заклинания."

UCP 1.3 / 7.5_mod

[rework2.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="Атакуя в ближнем бою, отряд получает возможность нанести дополнительный удар с бонусом к %ICON_ATTACK атаке. Длится несколько ходов."
mTooltipMagicGuildRankLine="%buff1.buff.buff1.buff.stat к %ICON_ATTACK атаке. Длительность (ходов): %buff1.buff.durini."
mTooltipUpgraded="Атакуя в ближнем бою, отряд получает возможность нанести дополнительный удар с бонусом %buff2.buff.buff1.buff.stat к %ICON_ATTACK атаке. Если противник наносит ответный удар, дополнительная атака выполняется сразу после него.\nДлительность (ходов): %buff2.buff.durini."
mName="Молниеносная реакция"
mTooltip="Атакуя в ближнем бою, отряд получает возможность нанести дополнительный удар с бонусом %buff1.buff.buff1.buff.stat к %ICON_ATTACK атаке. Если противник наносит ответный удар, дополнительная атака выполняется сразу после него.\nДлительность (ходов): %buff1.buff.durini."

[A_LightningReflexes_Buff H7BaseBuff]
mName="Молниеносная реакция"
mTooltip="Атакуя в ближнем бою, отряд получает возможность нанести дополнительный удар с бонусом %buff1.buff.stat к %ICON_ATTACK атаке. Если противник наносит ответный удар, дополнительная атака выполняется сразу после него.\nДлительность (ходов): %durnow."

[A_LightningReflexes_Buff_Upgraded H7BaseBuff]
mName="Молниеносная реакция"
mTooltip="Атакуя в ближнем бою, отряд получает возможность нанести дополнительный удар с бонусом %buff1.buff.stat к %ICON_ATTACK атаке. Если противник наносит ответный удар, дополнительная атака выполняется перед ним.\nДлительность (ходов): %durnow."

[Imprinted.A_LightningReflexes_Imprinted H7HeroAbility]
mName="Молниеносная реакция"
mTooltip="Атакуя в ближнем бою, отряд получает возможность нанести дополнительный удар. Длительность эффекта (ходов): %buff1.buff.durini. Если враг наносит ответный удар, дополнительная атака выполняется сразу после него."

[Imprinted.A_LightningReflexes_Imprinted_Buff H7BaseBuff]
mName="Молниеносная реакция"
mTooltip="Атакуя в ближнем бою, отряд получает возможность нанести дополнительный удар. Если противник наносит ответный удар, дополнительная атака выполняется сразу после него.\nДлительность (ходов): %durnow."

[rework.A_Nova H7HeroAbility]
mName="Вихрь"
mTooltip="Вихрь наносит всем существам в выбранной области 2x2 от %d1.min до %d1.max ед. урона от %d.icon магии воздуха, поднимает их над землей и случайным образом разбрасывает в окружающей области 8x8."
mTooltipMagicGuild="Вихрь наносит урон от %ICON_AIR магии воздуха всем существам в выбранной области 2x2, поднимает их над землей и случайным образом разбрасывает в окружающей области 8x8."
mTooltipUpgraded="Вихрь наносит всем существам в выбранной области 3x3 от %d2.min до %d2.max ед. урона от %d.icon магии воздуха, поднимает их над землей и случайным образом разбрасывает в окружающей области 9x9. Малые существа получают двойной урон."
mTooltipMagicGuildRankLine="от %d1.min до %d1.max ед. урона %ICON_AIR"